- expression: 1 + 1
  result: 2

- expression: 1.23 * 4
  result: 4.92

- expression: 1 / 2
  result: 0

- expression: 1.0 / 2
  result: 0.5

- expression: 1 / 2.0
  result: 0.5

- expression: 1 * -++-+-5
  result: -5

- expression: a + b
  variables:
    a: 10
    b: 2
  result: 12

- expression: a % b + 2
  variables:
    a: 5
    b: 2
  result: 3

- expression: a % (b + 2)
  variables:
    a: 5
    b: 2
  result: 1

- expression: a / b + b - c * d
  variables:
    a: 5
    b: 2
    c: 10
    d: 3
  result: -26

- expression: 'add(1, 2)'
  result: 3

- expression: 'sub(3, 2.0)'
  result: 1.0

- expression: '1 + 3.0 * add(1, sub(2, 5 * 10))'
  result: -140.0

- expression: 'add(sub(a, b), c) * 1.0'
  variables:
    a: 3
    b: 4
    c: 5
  result: 4.0

- expression: 'nop(1 + 2 + 3)'
  result: 6

- expression: 'power(2, 0)'
  result: 1

- expression: 'power(2, 1)'
  result: 2

- expression: 'power(2, 2)'
  result: 4

- expression: 'power(2, 3)'
  result: 8

- expression: 'power(2, 4)'
  result: 16

- expression: 'power(2, 5)'
  result: 32

- expression: 'power(2, 6)'
  result: 64

- expression: 'power(2, 7)'
  result: 128

- expression: 'power(2, 8)'
  result: 256

- expression: 'power(2, 9)'
  result: 512

- expression: 'power(2, 10)'
  result: 1024

- expression: 'power(2, 11)'
  result: 2048

- expression: 'power(2, 12)'
  result: 4096

- expression: 'power(2, 13)'
  result: 8192

- expression: 'power(2, 14)'
  result: 16384

- expression: 'power(2, 15)'
  result: 32768

- expression: 'power(0, 0)'
  result: 1

- expression: 'power(2, power(3, 4)) + 1'
  result: 2417851639229258349412353

- expression: 'powermod(2, 11, 31) + 1'
  result: 2

- expression: 'powermod(2, 1999999, 31)'
  result: 16
